Autodesk.Revit.DB.LogicalAndFilter.#ctor(System.Collections.Generic.IList`1{Autodesk.Revit.DB.ElementFilter})
Constructs a new instance of the logical filter with any number of input filters.
Remarks:
The input filters will be copied.
filters:
A collection of input filters.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The filter collection is empty, or contains invalid inputs.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011